ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT18</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT19</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT20</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT21</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT22</name>
              <description>Falling trigger event configuration bit of configurable event input i
When EXTI_SECCFGR.SECi is disabled, FTi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, FTi can only be accessed with secure access. Nonsecure write to this FTi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, FTi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, FTi can only be accessed with privileged access. Unprivileged write to this FTi is discarded, unprivileged read returns 0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Falling trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Falling trigger enabled (for event and interrupt) for input line.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
