ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
            </field>
            <field>
              <name>RPIF16</name>
              <description>Configurable event input i rising edge pending bit
When EXTI_SECCFGR.SECi is disabled, RPIFi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, RPIFi can only be accessed with secure access. Nonsecure write to this RPIFi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, RPIFi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, RPIFi can only be accessed with privileged access. Unprivileged write to this RPIFi is discarded, unprivileged read returns 0.
This bit is set when the rising edge event or an EXTI_SWIER software trigger arrives on the configurable event line. This bit is cleared by writing 1 to it.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No rising edge trigger request occurred.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising edge trigger request occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPIF17</name>
              <description>Configurable event input i rising edge pending bit
When EXTI_SECCFGR.SECi is disabled, RPIFi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, RPIFi can only be accessed with secure access. Nonsecure write to this RPIFi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, RPIFi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, RPIFi can only be accessed with privileged access. Unprivileged write to this RPIFi is discarded, unprivileged read returns 0.
This bit is set when the rising edge event or an EXTI_SWIER software trigger arrives on the configurable event line. This bit is cleared by writing 1 to it.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No rising edge trigger request occurred.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising edge trigger request occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPIF18</name>
              <description>Configurable event input i rising edge pending bit
When EXTI_SECCFGR.SECi is disabled, RPIFi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, RPIFi can only be accessed with secure access. Nonsecure write to this RPIFi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, RPIFi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, RPIFi can only be accessed with privileged access. Unprivileged write to this RPIFi is discarded, unprivileged read returns 0.
This bit is set when the rising edge event or an EXTI_SWIER software trigger arrives on the configurable event line. This bit is cleared by writing 1 to it.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No rising edge trigger request occurred.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising edge trigger request occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPIF19</name>
              <description>Configurable event input i rising edge pending bit
When EXTI_SECCFGR.SECi is disabled, RPIFi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, RPIFi can only be accessed with secure access. Nonsecure write to this RPIFi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, RPIFi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, RPIFi can only be accessed with privileged access. Unprivileged write to this RPIFi is discarded, unprivileged read returns 0.
This bit is set when the rising edge event or an EXTI_SWIER software trigger arrives on the configurable event line. This bit is cleared by writing 1 to it.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No rising edge trigger request occurred.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising edge trigger request occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPIF20</name>
              <description>Configurable event input i rising edge pending bit
When EXTI_SECCFGR.SECi is disabled, RPIFi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, RPIFi can only be accessed with secure access. Nonsecure write to this RPIFi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, RPIFi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, RPIFi can only be accessed with privileged access. Unprivileged write to this RPIFi is discarded, unprivileged read returns 0.
This bit is set when the rising edge event or an EXTI_SWIER software trigger arrives on the configurable event line. This bit is cleared by writing 1 to it.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No rising edge trigger request occurred.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising edge trigger request occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPIF21</name>
              <description>Configurable event input i rising edge pending bit
When EXTI_SECCFGR.SECi is disabled, RPIFi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, RPIFi can only be accessed with secure access. Nonsecure write to this RPIFi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, RPIFi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, RPIFi can only be accessed with privileged access. Unprivileged write to this RPIFi is discarded, unprivileged read returns 0.
This bit is set when the rising edge event or an EXTI_SWIER software trigger arrives on the configurable event line. This bit is cleared by writing 1 to it.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No rising edge trigger request occurred.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising edge trigger request occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPIF22</name>
              <description>Configurable event input i rising edge pending bit
When EXTI_SECCFGR.SECi is disabled, RPIFi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, RPIFi can only be accessed with secure access. Nonsecure write to this RPIFi is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, RPIFi can be accessed with unprivileged and privileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, RPIFi can only be accessed with privileged access. Unprivileged write to this RPIFi is discarded, unprivileged read returns 0.
This bit is set when the rising edge event or an EXTI_SWIER software trigger arrives on the configurable event line. This bit is cleared by writing 1 to it.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No rising edge trigger request occurred.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising edge trigger request occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
