ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
        <register>
          <name>EXTI_SECCFGR1</name>
          <displayName>EXTI security configuration register</displayName>
          <description>This register provides write access security. A nonsecure write access is ignored and causes the generation of an illegal access event. A nonsecure read returns the register data. This register contains only bits for security capable input events.</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC0</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC1</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC2</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC3</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC4</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC5</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC6</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC7</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC8</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC9</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC10</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC11</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC12</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC13</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC14</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC15</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC16</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC17</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC18</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC19</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC20</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC21</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC22</name>
              <description>Security enable on event input i
When EXTI_PRIVCFGR.PRIVi is disabled, SECi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, SECi can only be written with privileged access. Unprivileged write to this SECi is discarded.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Event security disabled (nonsecure)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Event security enabled (secure)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
