ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
        <register>
          <name>EXTI_EXTICR3</name>
          <displayName>EXTI_EXTICR3</displayName>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI8</name>
              <description>EXTI8 GPIO port selection
These bits are written by software to select the source input for EXTI8 external interrupt.
When EXTI_SECCFGR.SEC8 is disabled, this bit field can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SEC8 is enabled, this bit field can only be accessed with secure access. Nonsecure write is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIV8 is disabled, this bit field can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIV8 is enabled, this bit field can only be accessed with privileged access. Unprivileged write to this bit is discarded.
Others: Reserved
Note: Port F is only available in STM32U3B5/3C5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[8] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[8] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[8] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[8] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[8] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[8] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[8] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[8] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI9</name>
              <description>EXTI9 GPIO port selection
These bits are written by software to select the source input for EXTI9 external interrupt.
When EXTI_SECCFGR.SEC9 is disabled, this bit field can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SEC9 is enabled, this bit field can only be accessed with secure access. Nonsecure write is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIV9 is disabled, this bit field can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIV9 is enabled, this bit field can only be accessed with privileged access. Unprivileged write to this bit is discarded.
Others: Reserved
Note: Port F is only available in STM32U3B5/3C5.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[9] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[9] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[9] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[9] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[9] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[9] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[9] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[9] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI10</name>
              <description>EXTI10 GPIO port selection
These bits are written by software to select the source input for EXTI10 external interrupt.
When EXTI_SECCFGR.SEC10 is disabled, this bit field can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SEC10 is enabled, this bit field can only be accessed with secure access. Nonsecure write is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIV10 is disabled, this bit field can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIV10 is enabled, this bit field can only be accessed with privileged access. Unprivileged write to this bit is discarded.
Others: Reserved
Note: Port F is only available in STM32U3B5/3C5.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[10] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[10] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[10] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[10] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[10] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[10] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[10] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[10] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI11</name>
              <description>EXTI11 GPIO port selection
These bits are written by software to select the source input for EXTI11 external interrupt.
When EXTI_SECCFGR.SEC11 is disabled, this bit field can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SEC11 is enabled, this bit field can only be accessed with secure access. Nonsecure write is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIV11 is disabled, this bit field can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIV11 is enabled, this bit field can only be accessed with privileged access. Unprivileged write to this bit is discarded.
Others: Reserved
Note: Port F is only available in STM32U3B5/3C5.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[11] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[11] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[11] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[11] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[11] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[11] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[11] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[11] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_EXTICR4</name>
          <displayName>EXTI_EXTICR4</displayName>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI12</name>
              <description>EXTI12 GPIO port selection
These bits are written by software to select the source input for EXTI12 external interrupt.
When EXTI_SECCFGR.SEC12 is disabled, this bit field can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SEC12 is enabled, this bit field can only be accessed with secure access. Nonsecure write is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIV12 is disabled, this bit field can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIV12 is enabled, this bit field can only be accessed with privileged access. Unprivileged write to this bit is discarded.
Others: Reserved
Note: Port F is only available in STM32U3B5/3C5.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[12] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[12] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[12] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[12] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[12] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[12] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[12] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[12] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI13</name>
              <description>EXTI13 GPIO port selection
These bits are written by software to select the source input for EXTI13 external interrupt.
When EXTI_SECCFGR.SEC13 is disabled, this bit field can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SEC13 is enabled, this bit field can only be accessed with secure access. Nonsecure write is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIV13 is disabled, this bit field can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIV13 is enabled, this bit field can only be accessed with privileged access. Unprivileged write to this bit is discarded.
Others: Reserved
Note: Port F is only available in STM32U3B5/3C5.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[13] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[13] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[13] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[13] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[13] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[13] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[13] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[13] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI14</name>
              <description>EXTI14 GPIO port selection
These bits are written by software to select the source input for EXTI14 external interrupt.
When EXTI_SECCFGR.SEC14 is disabled, this bit field can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SEC14 is enabled, this bit field can only be accessed with secure access. Nonsecure write is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIV14 is disabled, this bit field can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIV14 is enabled, this bit field can only be accessed with privileged access. Unprivileged write to this bit is discarded.
Others: Reserved
Note: Port F is only available in STM32U3B5/3C5.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[14] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[14] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[14] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[14] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[14] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[14] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[14] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[14] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTI15</name>
              <description>EXTI15 GPIO port selection
These bits are written by software to select the source input for EXTI15 external interrupt.
When EXTI_SECCFGR.SEC15 is disabled, this bit field can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SEC15 is enabled, this bit field can only be accessed with secure access. Nonsecure write is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIV15 is disabled, this bit field can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIV15 is enabled, this bit field can only be accessed with privileged access. Unprivileged write to this bit is discarded.
Others: Reserved
Note: Port F is only available in STM32U3B5/3C5.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[15] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[15] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[15] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[15] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[15] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x05</name>
                  <description>PF[15] pin</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[15] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[15] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_LOCKR</name>
          <displayName>EXTI lock register</displayName>
          <description>This register provides write access security: a nonsecure write access is ignored, a read access returns zero data, and both generates an illegal access event.</description>
          <addressOffset>0x070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Global security and privilege configuration registers (EXTI_SECCFGR and EXTI_PRIVCFGR) lock
This bit is written once after reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Security and privilege configuration open, can be modified.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Security and privilege configuration locked, can no longer be modified.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
