ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
        <register>
          <name>EXTI_IMR1</name>
          <displayName>EXTI CPU wake-up with interrupt mask register</displayName>
          <description>This register contains bits for configurable events.</description>
          <addressOffset>0x080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IM0</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM1</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM2</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM3</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM4</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM5</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM6</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM7</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM8</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM9</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM10</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM11</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM12</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM13</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM14</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM15</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM16</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM17</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
