ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM18</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM19</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM20</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM21</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IM22</name>
              <description>CPU wake-up with interrupt mask on event input i
When EXTI_SECCFGR.SECi is disabled, IMi can be accessed with nonsecure and secure access.
When EXTI_SECCFGR.SECi is enabled, IMi can only be accessed with secure access. Nonsecure write to this bit is discarded. Nonsecure read returns 0.
When EXTI_PRIVCFGR.PRIVi is disabled, IMi can be accessed with privileged and unprivileged access.
When EXTI_PRIVCFGR.PRIVi is enabled, IMi can only be accessed with privileged access. Unprivileged write to this bit is discarded.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Wake-up with interrupt request from input event i is masked.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Wake-up with interrupt request from input event i is unmasked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
