ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC21</name>
              <description>Page secure/nonsecure attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 not block-based secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC22</name>
              <description>Page secure/nonsecure attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 not block-based secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC23</name>
              <description>Page secure/nonsecure attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 not block-based secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC24</name>
              <description>Page secure/nonsecure attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 not block-based secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC25</name>
              <description>Page secure/nonsecure attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 not block-based secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC26</name>
              <description>Page secure/nonsecure attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 not block-based secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC27</name>
              <description>Page secure/nonsecure attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 not block-based secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC28</name>
              <description>Page secure/nonsecure attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 not block-based secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC29</name>
              <description>Page secure/nonsecure attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 not block-based secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC30</name>
              <description>Page secure/nonsecure attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 not block-based secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC31</name>
              <description>Page secure/nonsecure attribution
Each bit is used to set one page security attribution in bank 2.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 not block-based secure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Page (32 * (x - 1) + i) in bank 2 block-based secure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECHDPCR</name>
          <displayName>FLASH secure HDP control register</displayName>
          <description>This register is secure. It can be read and written only by secure access. A nonsecure read/write access is RAZ/WI. This register can be protected against unprivileged access when SPRIV = 1 in FLASH_PRIVCFGR register.</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA3A3A3A3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HDP1_ACCDIS</name>
              <description>HDP1 area access disable
When set to a value different than 0xA3, this bit field cannot be modified except by a system reset.
Others: Access to HDP1 area denied (SECWM1Ry option bytes modification blocked - refer to Rules for modifying specific option bytes). When HDP1_ACCDIS value is different than 0xA3, any write access to HDP1_ACCDIS is ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xA3</name>
                  <description>Access to HDP1 area granted</description>
                  <value>0xA3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HDP2_ACCDIS</name>
              <description>HDP2 area access disable
When set to a value different than 0xA3, this bit field cannot be modified except by a system reset.
Others: Access to HDP2 area denied (SECWM2Ry option-byte modification blocked - refer to Rules for modifying specific option bytes). When HDP2_ACCDIS value is different than 0xA3, any write access to HDP2_ACCDIS is ignored.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xA3</name>
                  <description>Access to HDP2 area granted</description>
                  <value>0xA3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HDP1EXT_ACCDIS</name>
              <description>HDP1 extension area access disable
Register access depends on its current value. Refer to HDP extension area access for the full conditions.
Others: Access to HDP1 extension area and HDP1 area denied. update of HDP1_EXT size is not possible anymore .(SECWM1Ry option bytes modification blocked - refer to Rules for modifying specific option bytes)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xA3</name>
                  <description>Access to HDP1 extension area granted</description>
                  <value>0xA3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5C</name>
                  <description>Access to HDP1 extension area and HDP1 area denied, but HDP1_EXT (in FLASH_HDPEXTR) increment allowed at any time. (SECWM1Ry option bytes modification blocked - refer to Rules for modifying specific option bytes)</description>
                  <value>0x5C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HDP2EXT_ACCDIS</name>
              <description>HDP2 extension area access disable
Register access depends on its current value. Refer to HDP extension area access for the full conditions.
Others: Access to HDP2 extension area and HDP2 area denied. Update of HDP2_EXT size is not possible anymore .(SECWM2Ry option bytes modification blocked - refer to Rules for modifying specific option bytes)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xA3</name>
                  <description>Access to HDP2 extension area granted</description>
                  <value>0xA3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5C</name>
                  <description>Access to HDP2 extension area and HDP2 area denied, but HDP2_EXT (in FLASH_HDPEXTR) increment allowed at any time. (SECWM2Ry option bytes modification blocked - refer to Rules for modifying specific option bytes).</description>
                  <value>0x5C</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PRIVCFGR</name>
          <displayName>FLASH privilege configuration register</displayName>
          <description>This register can be read by both privileged and unprivileged access. PRIV is a nonsecure bit. SPRIV is a secure bit.</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPRIV</name>
              <description>Privileged protection for secure registers
This bit can be accessed only when TrustZone is enabled (TZEN = 1). This bit can be read by both privileged or unprivileged, secure and nonsecure access. This bit can be written only by a secure privileged access. A nonsecure write access on SPRIV bit is ignored. A secure unprivileged write access on SPRIV bit is ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Secure FLASH registers can be read and written by privileged or unprivileged access.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure FLASH registers can be read and written by privileged access only.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV</name>
              <description>Privileged protection for nonsecure registers
This bit can be read by both privileged or unprivileged, secure and nonsecure access. This bit can be written by a secure or nonsecure privileged access. A secure or nonsecure unprivileged write access on PRIV bit is ignored</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Nonsecure FLASH registers can be read and written by privileged or unprivileged access.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Nonsecure FLASH registers can be read and written by privileged access only.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECHDPEXTR</name>
          <displayName>FLASH HDP extension register</displayName>
          <description>This register is secure. It can be read and written only by secure access. This register can be protected against unprivileged access when SPRIV = 1 in FLASH_PRIVCFGR register.</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HDP1_EXT</name>
              <description>HDP area extension in 4-Kbyte pages in bank 1
The extension starts at page offset HDP1_END+1 if HDP1 area is enable (HDP1EN = 0xB4). Otherwise, it starts at page offset SECWM1_STRT.
Register access depends on HDP1EXT_ACCDIS value (refer to HDP extension area access for the full conditions.
Note: HDP1_EXT[8] is reserved for STM32U375/385.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDP2_EXT</name>
              <description>HDP area extension in 4-Kbyte pages in bank 2
The extension starts at page offset HDP2_END+1 if HDP2 area is enable (HDP2EN = 0xB4). Otherwise, it starts at page offset SECWM2_STRT.
Register access depends on HDP2EXT_ACCDIS value (Refer to HDP extension area access for the full conditions).
Note: HDP2_EXT[8] is reserved for STM32U375/385.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
