ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
        <register>
          <name>GPDMA_C11BR1</name>
          <displayName>GPDMA_C11BR1</displayName>
          <description>GPDMA channel 11 block register 1 </description>
		  <alternateRegister>GPDMA_C9BR1</alternateRegister>
          <addressOffset>0x518</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BNDT</name>
              <description>Block size transferred from the source. When the channel is enabled, this field becomes read-only and is decremented, indicating the remaining number of data items in the current source block to be transferred. BNDT[15:0] is programmed in number of bytes, maximum source block size is 64 Kbytes -1.
Once the last data transfer is completed (BNDT[15:0] = 0):
- if GPDMA_C11LLR.UB1 = 1, this field is updated by the LLI in the memory.
- if GPDMA_C11LLR.UB1 = 0 and if there is at least one not null Uxx update bit, this field is internally restored to the programmed value.
- if all GPDMA_C11LLR.Uxx = 0 and if GPDMA_C11LLR.LA[15:0] is not equal to  0, this field is internally restored to the programmed value (infinite/continuous last LLI).
- if GPDMA_C11LLR = 0, this field is kept as zero following the last LLI data transfer.
Note: A non-null source block size must be a multiple of the source data width (BNDT[2:0] versus GPDMA_C11TR1.SDW_LOG2[1:0]). Else a user setting error is reported and no transfer is issued.
+: When configured in packing mode (GPDMA_C11TR1.PAM[1] = 1 and destination data width different from source data width), a non-null source block size must be a multiple of the destination data width (BNDT[2:0] versus GPDMA_C{x}TR1.DDW_LOG2[1:0]). Else a user setting error is reported and no transfer is issued.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRC</name>
              <description>This field contains the number of repetitions of the current block (0 to 2047). 
When the channel is enabled, this field becomes read-only. After decrements, this field indicates the remaining number of blocks, excluding the current one. This counter is hardware decremented for each completed block transfer.
Once the last block transfer is completed (BRC[10:0] = BNDT[15:0] = 0):
- If GPDMA_C11LLR.UB1 = 1, all GPDMA_C11BR1 fields are updated by the next LLI in the memory.
- If GPDMA_C11LLR.UB1 = 0 and if there is at least one not null Uxx update bit, this field is internally restored to the programmed value.
- if all GPDMA_C11LLR.Uxx = 0 and if GPDMA_C11LLR.LA[15:0] is not equal to 0, this field is internally restored to the programmed value (infinite/continuous last LLI). 
- if GPDMA_C11LL R = 0, this field is kept as zero following the last LLI and data transfer.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDEC</name>
              <description>None
0: At the end of a programmed burst transfer from the source, the GPDMA_C11SAR register is updated by adding the programmed offset GPDMA_C11TR3.SAO to the current GPDMA_C11SAR value (current source address)
1: At the end of a programmed burst transfer from the source, the GPDMA_C11SAR register is updated by subtracting the programmed offset GPDMA_C11TR3.SAO to the current GPDMA_C11SAR value (current source address)
</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>At the end of a programmed burst transfer from the source, the GPDMA_C11SAR register is updated by adding the programmed offset GPDMA_C11TR3.SAO to the current GPDMA_C11SAR value (current source address)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>At the end of a programmed burst transfer from the source, the GPDMA_C11SAR register is updated by subtracting the programmed offset GPDMA_C11TR3.SAO to the current GPDMA_C11SAR value (current source address)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDEC</name>
              <description>None
0: At the end of a programmed burst transfer to the destination, the GPDMA_C11DAR register is updated by adding the programmed offset GPDMA_C11TR3.DAO to the current GPDMA_C11DAR value (current destination address)
1: At the end of a programmed burst transfer to the destination, the GPDMA_C11DAR register is updated by subtracting the programmed offset GPDMA_C11TR3.DAO to the current GPDMA_C11DAR value (current destination address)
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>At the end of a programmed burst transfer to the destination, the GPDMA_C11DAR register is updated by adding the programmed offset GPDMA_C11TR3.DAO to the current GPDMA_C11DAR value (current destination address)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>At the end of a programmed burst transfer to the destination, the GPDMA_C11DAR register is updated by subtracting the programmed offset GPDMA_C11TR3.DAO to the current GPDMA_C11DAR value (current destination address)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRSDEC</name>
              <description>None
0: at the end of a block transfer, the GPDMA_C11SAR register is updated by adding the programmed offset GPDMA_C11BR2.BRSAO to the current GPDMA_C11SAR value (current source address)
1: at the end of a block transfer, the GPDMA_C11SAR register is updated by subtracting the programmed offset GPDMA_C11BR2.BRSAO from the current GPDMA_C11SAR value (current source address)
Note: On top of this increment/decrement (depending on BRSDEC), GPDMA_C11SAR is in the same time also updated by the increment/decrement (depending on SDEC) of the GPDMA_C11TR3.SAO value, as it is done after any programmed burst transfer.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>at the end of a block transfer, the GPDMA_C11SAR register is updated by adding the programmed offset GPDMA_C11BR2.BRSAO to the current GPDMA_C11SAR value (current source address)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>at the end of a block transfer, the GPDMA_C11SAR register is updated by subtracting the programmed offset GPDMA_C11BR2.BRSAO from the current GPDMA_C11SAR value (current source address)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRDDEC</name>
              <description>None
0: at the end of a block transfer, the GPDMA_C11DAR register is updated by adding the programmed offset GPDMA_C11BR2.BRDAO to the current GPDMA_C11DAR value (current destination address)
1: at the end of a block transfer, the GPDMA_C11DAR register is updated by subtracting the programmed offset GPDMA_C11BR2.BRDAO from the current GPDMA_C11DAR value (current destination address)
Note: On top of this increment/decrement (depending on BRDDEC), GPDMA_C11DAR is in the same time also updated by the increment/decrement (depending on DDEC) of the GPDMA_C11TR3.DAO value, as it is usually done at the end of each programmed bursttransfer.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>at the end of a block transfer, the GPDMA_C11DAR register is updated by adding the programmed offset GPDMA_C11BR2.BRDAO to the current GPDMA_C11DAR value (current destination address)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>at the end of a block transfer, the GPDMA_C11DAR register is updated by subtracting the programmed offset GPDMA_C11BR2.BRDAO from the current GPDMA_C11DAR value (current destination address)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C9SAR</name>
          <displayName>GPDMA_C9SAR</displayName>
          <description>GPDMA channel 9 source address register </description>
          <addressOffset>0x51C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SA</name>
              <description>This field is the pointer to the address from which the next data is read.
During the channel activity, depending on the source addressing mode (GPDMA_C9TR1.SINC), this field is kept fixed or incremented by the data width (GPDMA_C9TR1.SDW_LOG2[1:0]) after each burst source data, reflecting the next address from which data is read.
During the channel activity, this address is updated after each completed source burst, consequently to:
- the programmed source burst; either in fixed addressing mode or in contiguous-data incremented mode. If contiguously incremented (GPDMA_C9TR1.SINC = 1), then the additional address offset value is the programmed burst size, as defined by GPDMA_C9TR1.SBL_1[5:0] and GPDMA_C9TR1.SDW_LOG2[21:0]
- the additional source incremented/decremented offset value as programmed by GPDMA_C9BR1.SDEC and GPDMA_CxTR3.SAO[12:0].
- once/if completed source block transfer, for a channel 9 with 2D addressing capability (x = 12 to 15). additional block repeat source incremented/decremented offset value as programmed by GPDMA_C9BR1.BRSDEC and GPDMA_CxBR2.BRSAO[15:0]
In linked-list mode, after a LLI data transfer is completed, this register is automatically updated by GPDMA from the memory, provided the LLI is set with GPDMA_C9LLR.USA = 1.
Note: A source address must be aligned with the programmed data width of a source burst (SA[2:0] versus GPDMA_C9TR1.SDW_LOG2[1:0]). Else, a user setting error is reported and no transfer is issued.
+: When the source block size is not a multiple of the source burst size and is a multiple of the source data width, the last programmed source burst is not completed and is internally shorten to match the block size. In this case, the additional GPDMA_CxTR3.SAO[12:0] is not applied.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C9DAR</name>
          <displayName>GPDMA_C9DAR</displayName>
          <description>GPDMA channel 9 destination address register </description>
          <addressOffset>0x520</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DA</name>
              <description>This field is the pointer to the address from which the next data is written.
During the channel activity, depending on the destination addressing mode (GPDMA_C9TR1.DINC), this field is kept fixed or incremented by the data width (GPDMA_C9TR1.DDW_LOG2[21:0]) after each burst destination data, reflecting the next address from which data is written.
During the channel activity, this address is updated after each completed destination burst, consequently to:
- the programmed destination burst; either in fixed addressing mode or in contiguous-data incremented mode. If contiguously incremented (GPDMA_C9TR1.DINC = 1), then the additional address offset value is the programmed burst size, as defined by GPDMA_C9TR1.DBL_1[5:0] and GPDMA_C9TR1.DDW_LOG2[1:0]
- the additional destination incremented/decremented offset value as programmed by GPDMA_C9BR1.DDEC and GPDMA_CxTR3.DAO[12:0].
- once/if completed destination block transfer, for a channel 9 with 2D addressing capability (x=12to15), the additional block repeat destination incremented/decremented offset value as programmed by GPDMA_C9BR1.BRDDEC and GPDMA_CxBR2.BRDAO[15:0]
In linked-list mode, after a LLI data transfer is completed, this register is automatically updated by the GPDMA from the memory, provided the LLI is set with GPDMA_C9LLR.UDA = 1.
Note: A destination address must be aligned with the programmed data width of a destination burst (DA[2:0] versus GPDMA_C9TR1.DDW_LOG2[1:0]). Else, a user setting error is reported and no transfer is issued.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C11TR3</name>
          <displayName>GPDMA_C11TR3</displayName>
          <description>GPDMA channel 11 transfer register 3 </description>
          <addressOffset>0x524</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAO</name>
              <description>The source address, pointed by GPDMA_CxSAR, is incremented or decremented (depending on GPDMA_C11BR1.SDEC) by this offset SAO[12:0] for each programmed source burst. This offset is not including and is added to the programmed burst size when the completed burst is addressed in incremented mode (GPDMA_C11TR1.SINC = 1). 
Note: A source address offset must be aligned with the programmed data width of a source burst (SAO[2:0] versus GPDMA_C11TR1.SDW_LOG2[1:0]). Else a user setting error is reported and none transfer is issued.
+: When the source block size is not a multiple of the destination burst size and is a multiple of the source data width, then the last programmed source burst is not completed and is internally shorten to match the block size. In this case, the additional GPDMA_CxTR3.SAO[12:0] is not applied.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAO</name>
              <description>The destination address, pointed by GPDMA_CxDAR, is incremented or decremented (depending on GPDMA_C11BR1.DDEC) by this offset DAO[12:0] for each programmed destination burst. This offset is not including and is added to the programmed burst size when the completed burst is addressed in incremented mode (GPDMA_C11TR1.DINC = 1). 
Note: A destination address offset must be aligned with the programmed data width of a destination burst (DAO[2:0] versus GPDMA_C11TR1.DDW_LOG2[1:0]). Else, a user setting error is reported and no transfer is issued.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDMA_C11BR2</name>
          <displayName>GPDMA_C11BR2</displayName>
          <description>GPDMA channel 11 block register 2 </description>
          <addressOffset>0x528</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BRSAO</name>
              <description>For a channel with 2D addressing capability, this field is used to update (by addition or subtraction depending on GPDMA_C11BR1.BRSDEC) the current source address (GPDMA_CxSAR) at the end of a block transfer.
Note: A block repeated source address offset must be aligned with the programmed data width of a source burst (BRSAO[2:0] versus GPDMA_C11TR1.SDW_LOG2[1:0]). Else a user setting error is reported and no transfer is issued.
+: BRSAO[15:0] must be set to 0 in peripheral flow-control mode (ifGPDMA_C11TR2.PFREQ = 1).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRDAO</name>
              <description>For a channel with 2D addressing capability, this field is used to update (by addition or subtraction depending on GPDMA_C11BR1.BRDDEC) the current destination address (GPDMA_CxDAR) at the end of a block transfer.
Note: A block repeated destination address offset must be aligned with the programmed data width of a destination burst (BRDAO[2:0] versus GPDMA_C11TR1.DDW_LOG2[1:0]). Else a user setting error is reported and no transfer is issued.
+: BRDAO[15:0] must be set to 0 in peripheral flow-control mode (ifGPDMA_C11TR2.PFREQ = 1).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
