ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
        <register>
          <name>GPIOB_HSLVR</name>
          <displayName>GPIO high-speed low-voltage register</displayName>
          <description>Individual bits of this register are protected against nonsecure access when corresponding SECy = 1 in GPIO_SECCFGR and the system is secure (TZEN = 1).</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSLV0</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV1</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV2</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV3</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV4</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV5</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV6</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV7</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV8</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV9</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV10</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV11</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV12</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV13</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>I/O speed optimization disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>I/O speed optimization enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSLV14</name>
              <description>Port x I/O pin y high-speed low-voltage configuration
These bits are written by software to optimize the I/O speed when the I/O supply is low.
Each bit is active only if the corresponding IO_VDD_HSLV/IO_VDDIO2_HSLV user option bit is set. It must be used only if the I/O supply voltage is below 2.7 V. 
Setting these bits when the I/O supply (V&lt;sub&gt;DD&lt;/sub&gt; or V&lt;sub&gt;DDIO2&lt;/sub&gt;) is higher than 2.7 V may be destructive. Setting this bit when the I/O is configured in Fm+ mode is forbidden.
Note: Not all I/Os support the HSLV mode. Refer to the I/O structure in the corresponding datasheet for the list of I/Os supporting this feature. HSLV configuration for the other I/Os must be kept at reset value.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
