ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
        <register>
          <name>GPIOH_OTYPER</name>
          <displayName>GPIO port output type register</displayName>
          <description>Individual bits of this register are protected against nonsecure access when corresponding SECy = 1 in GPIO_SECCFGR and the system is secure (TZEN = 1).</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OT0</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT1</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT2</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT3</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT4</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT5</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT6</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT7</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT8</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT9</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT10</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT11</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT12</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT13</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT14</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT15</name>
              <description>Port x I/O pin y output type configuration
These bits are written by software to configure the I/O output type.
Note: This bit is reserved and must be kept at reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output open-drain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
