ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
Unprivileged write to this bit is ignored if PRIV0 bit is set in GTZC1_MPCBB1_PRIVCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 0, belonging to super-block 5. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 0, belonging to super-block 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC1</name>
              <description>Security configuration for block 1

Unprivileged write to this bit is ignored if PRIV1 bit is set in GTZC1_MPCBB1_PRIVCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 1, belonging to super-block 5. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 1, belonging to super-block 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC2</name>
              <description>Security configuration for block 2

Unprivileged write to this bit is ignored if PRIV2 bit is set in GTZC1_MPCBB1_PRIVCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 2, belonging to super-block 5. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 2, belonging to super-block 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC3</name>
              <description>Security configuration for block 3

Unprivileged write to this bit is ignored if PRIV3 bit is set in GTZC1_MPCBB1_PRIVCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 3, belonging to super-block 5. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 3, belonging to super-block 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC4</name>
              <description>Security configuration for block 4

Unprivileged write to this bit is ignored if PRIV4 bit is set in GTZC1_MPCBB1_PRIVCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 4, belonging to super-block 5. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 4, belonging to super-block 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC5</name>
              <description>Security configuration for block 5

Unprivileged write to this bit is ignored if PRIV5 bit is set in GTZC1_MPCBB1_PRIVCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 5, belonging to super-block 5. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 5, belonging to super-block 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC6</name>
              <description>Security configuration for block 6

Unprivileged write to this bit is ignored if PRIV6 bit is set in GTZC1_MPCBB1_PRIVCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 6, belonging to super-block 5. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 6, belonging to super-block 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC7</name>
              <description>Security configuration for block 7

Unprivileged write to this bit is ignored if PRIV7 bit is set in GTZC1_MPCBB1_PRIVCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 7, belonging to super-block 5. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 7, belonging to super-block 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC8</name>
              <description>Security configuration for block 8

Unprivileged write to this bit is ignored if PRIV8 bit is set in GTZC1_MPCBB1_PRIVCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 8, belonging to super-block 5. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 8, belonging to super-block 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC9</name>
              <description>Security configuration for block 9

Unprivileged write to this bit is ignored if PRIV9 bit is set in GTZC1_MPCBB1_PRIVCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 9, belonging to super-block 5. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 9, belonging to super-block 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC10</name>
              <description>Security configuration for block 10

Unprivileged write to this bit is ignored if PRIV10 bit is set in GTZC1_MPCBB1_PRIVCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 10, belonging to super-block 5. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 10, belonging to super-block 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC11</name>
              <description>Security configuration for block 11

