ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
Unprivileged write to this bit is ignored if PRIV19 bit is set in GTZC1_MPCBB1_PRIVCFGR6.
Writes are ignored if SPLCK6 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 19, belonging to super-block 6. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 19, belonging to super-block 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC20</name>
              <description>Security configuration for block 20

Unprivileged write to this bit is ignored if PRIV20 bit is set in GTZC1_MPCBB1_PRIVCFGR6.
Writes are ignored if SPLCK6 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 20, belonging to super-block 6. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 20, belonging to super-block 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC21</name>
              <description>Security configuration for block 21

Unprivileged write to this bit is ignored if PRIV21 bit is set in GTZC1_MPCBB1_PRIVCFGR6.
Writes are ignored if SPLCK6 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 21, belonging to super-block 6. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 21, belonging to super-block 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC22</name>
              <description>Security configuration for block 22

Unprivileged write to this bit is ignored if PRIV22 bit is set in GTZC1_MPCBB1_PRIVCFGR6.
Writes are ignored if SPLCK6 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 22, belonging to super-block 6. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 22, belonging to super-block 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC23</name>
              <description>Security configuration for block 23

Unprivileged write to this bit is ignored if PRIV23 bit is set in GTZC1_MPCBB1_PRIVCFGR6.
Writes are ignored if SPLCK6 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 23, belonging to super-block 6. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 23, belonging to super-block 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC24</name>
              <description>Security configuration for block 24

Unprivileged write to this bit is ignored if PRIV24 bit is set in GTZC1_MPCBB1_PRIVCFGR6.
Writes are ignored if SPLCK6 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 24, belonging to super-block 6. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 24, belonging to super-block 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC25</name>
              <description>Security configuration for block 25

Unprivileged write to this bit is ignored if PRIV25 bit is set in GTZC1_MPCBB1_PRIVCFGR6.
Writes are ignored if SPLCK6 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 25, belonging to super-block 6. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 25, belonging to super-block 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC26</name>
              <description>Security configuration for block 26

Unprivileged write to this bit is ignored if PRIV26 bit is set in GTZC1_MPCBB1_PRIVCFGR6.
Writes are ignored if SPLCK6 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 26, belonging to super-block 6. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 26, belonging to super-block 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC27</name>
              <description>Security configuration for block 27

