ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
Non-secure write to this bit is ignored if SEC2 bit is set in GTZC1_MPCBB1_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 2, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 2, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV3</name>
              <description>Privileged configuration for block 3, belonging to super-block 0

Non-secure write to this bit is ignored if SEC3 bit is set in GTZC1_MPCBB1_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 3, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 3, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV4</name>
              <description>Privileged configuration for block 4, belonging to super-block 0

Non-secure write to this bit is ignored if SEC4 bit is set in GTZC1_MPCBB1_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 4, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 4, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV5</name>
              <description>Privileged configuration for block 5, belonging to super-block 0

Non-secure write to this bit is ignored if SEC5 bit is set in GTZC1_MPCBB1_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 5, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 5, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV6</name>
              <description>Privileged configuration for block 6, belonging to super-block 0

Non-secure write to this bit is ignored if SEC6 bit is set in GTZC1_MPCBB1_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 6, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 6, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV7</name>
              <description>Privileged configuration for block 7, belonging to super-block 0

Non-secure write to this bit is ignored if SEC7 bit is set in GTZC1_MPCBB1_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 7, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 7, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV8</name>
              <description>Privileged configuration for block 8, belonging to super-block 0

Non-secure write to this bit is ignored if SEC8 bit is set in GTZC1_MPCBB1_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 8, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 8, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV9</name>
              <description>Privileged configuration for block 9, belonging to super-block 0

Non-secure write to this bit is ignored if SEC9 bit is set in GTZC1_MPCBB1_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 9, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 9, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV10</name>
              <description>Privileged configuration for block 10, belonging to super-block 0

Non-secure write to this bit is ignored if SEC10 bit is set in GTZC1_MPCBB1_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 10, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 10, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV11</name>
              <description>Privileged configuration for block 11, belonging to super-block 0

