ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
Non-secure write to this bit is ignored if SEC20 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 20, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 20, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV21</name>
              <description>Privileged configuration for block 21, belonging to super-block 1

Non-secure write to this bit is ignored if SEC21 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 21, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 21, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV22</name>
              <description>Privileged configuration for block 22, belonging to super-block 1

Non-secure write to this bit is ignored if SEC22 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 22, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 22, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV23</name>
              <description>Privileged configuration for block 23, belonging to super-block 1

Non-secure write to this bit is ignored if SEC23 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 23, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 23, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV24</name>
              <description>Privileged configuration for block 24, belonging to super-block 1

Non-secure write to this bit is ignored if SEC24 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 24, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 24, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV25</name>
              <description>Privileged configuration for block 25, belonging to super-block 1

Non-secure write to this bit is ignored if SEC25 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 25, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 25, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV26</name>
              <description>Privileged configuration for block 26, belonging to super-block 1

Non-secure write to this bit is ignored if SEC26 bit is set in GTZC1_MPCBB1_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 26, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 26, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV27</name>
              <description>Privileged configuration for block 27, belonging to super-block 1

