ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
Non-secure write to this bit is ignored if SEC7 bit is set in GTZC1_MPCBB1_SECCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 7, belonging to super-block 5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 7, belonging to super-block 5</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV8</name>
              <description>Privileged configuration for block 8, belonging to super-block 5

Non-secure write to this bit is ignored if SEC8 bit is set in GTZC1_MPCBB1_SECCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 8, belonging to super-block 5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 8, belonging to super-block 5</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV9</name>
              <description>Privileged configuration for block 9, belonging to super-block 5

Non-secure write to this bit is ignored if SEC9 bit is set in GTZC1_MPCBB1_SECCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 9, belonging to super-block 5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 9, belonging to super-block 5</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV10</name>
              <description>Privileged configuration for block 10, belonging to super-block 5

Non-secure write to this bit is ignored if SEC10 bit is set in GTZC1_MPCBB1_SECCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 10, belonging to super-block 5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 10, belonging to super-block 5</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV11</name>
              <description>Privileged configuration for block 11, belonging to super-block 5

Non-secure write to this bit is ignored if SEC11 bit is set in GTZC1_MPCBB1_SECCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 11, belonging to super-block 5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 11, belonging to super-block 5</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV12</name>
              <description>Privileged configuration for block 12, belonging to super-block 5

Non-secure write to this bit is ignored if SEC12 bit is set in GTZC1_MPCBB1_SECCFGR5.
Writes are ignored if SPLCK5 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 12, belonging to super-block 5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 12, belonging to super-block 5</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV13</name>
              <description>Privileged configuration for block 13, belonging to super-block 5

