ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
Non-secure write to this bit is ignored if SEC27 bit is set in GTZC1_MPCBB1_SECCFGR11.
Writes are ignored if SPLCK11 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 27, belonging to super-block 11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 27, belonging to super-block 11</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV28</name>
              <description>Privileged configuration for block 28, belonging to super-block 11

Non-secure write to this bit is ignored if SEC28 bit is set in GTZC1_MPCBB1_SECCFGR11.
Writes are ignored if SPLCK11 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 28, belonging to super-block 11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 28, belonging to super-block 11</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV29</name>
              <description>Privileged configuration for block 29, belonging to super-block 11

Non-secure write to this bit is ignored if SEC29 bit is set in GTZC1_MPCBB1_SECCFGR11.
Writes are ignored if SPLCK11 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 29, belonging to super-block 11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 29, belonging to super-block 11</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV30</name>
              <description>Privileged configuration for block 30, belonging to super-block 11

Non-secure write to this bit is ignored if SEC30 bit is set in GTZC1_MPCBB1_SECCFGR11.
Writes are ignored if SPLCK11 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 30, belonging to super-block 11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 30, belonging to super-block 11</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV31</name>
              <description>Privileged configuration for block 31, belonging to super-block 11

Non-secure write to this bit is ignored if SEC31 bit is set in GTZC1_MPCBB1_SECCFGR11.
Writes are ignored if SPLCK11 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 31, belonging to super-block 11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 31, belonging to super-block 11</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GTZC1_MPCBB1">
      <name>GTZC1_MPCBB1_S</name>
      <baseAddress>0x50032C00</baseAddress>
    </peripheral>
    <peripheral>
      <name>GTZC1_MPCBB2</name>
      <description>GTZC1_MPCBB2 Address block</description>
      <baseAddress>0x40033000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x210</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GTZC1_MPCBB2_CR</name>
          <displayName>GTZC1 SRAM2 MPCBB control register</displayName>
          <description>Secure privileged access only.</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GLOCK</name>
              <description>lock the control register of the MPCBB until next reset

