ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
Unprivileged write to this bit is ignored if PRIV2 bit is set in GTZC1_MPCBB2_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 2, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 2, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC3</name>
              <description>Security configuration for block 3

Unprivileged write to this bit is ignored if PRIV3 bit is set in GTZC1_MPCBB2_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 3, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 3, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC4</name>
              <description>Security configuration for block 4

Unprivileged write to this bit is ignored if PRIV4 bit is set in GTZC1_MPCBB2_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 4, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 4, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC5</name>
              <description>Security configuration for block 5

Unprivileged write to this bit is ignored if PRIV5 bit is set in GTZC1_MPCBB2_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 5, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 5, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC6</name>
              <description>Security configuration for block 6

Unprivileged write to this bit is ignored if PRIV6 bit is set in GTZC1_MPCBB2_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 6, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 6, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC7</name>
              <description>Security configuration for block 7

Unprivileged write to this bit is ignored if PRIV7 bit is set in GTZC1_MPCBB2_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 7, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 7, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC8</name>
              <description>Security configuration for block 8

Unprivileged write to this bit is ignored if PRIV8 bit is set in GTZC1_MPCBB2_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 8, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 8, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC9</name>
              <description>Security configuration for block 9

