ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
Unprivileged write to this bit is ignored if PRIV30 bit is set in GTZC1_MPCBB2_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 30, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 30, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC31</name>
              <description>Security configuration for block 31

Unprivileged write to this bit is ignored if PRIV31 bit is set in GTZC1_MPCBB2_PRIVCFGR3.
Writes are ignored if SPLCK3 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 31, belonging to super-block 3. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 31, belonging to super-block 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTZC1_MPCBB2_PRIVCFGR0</name>
          <displayName>GTZC1 SRAM2 MPCBB privileged configuration for super-block 0 register</displayName>
          <description>The given reset value is valid when TZEN=1. The reset value is 0x00000000 when TZEN=0.
Write access to this register is privileged only. Any read is allowed.</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIV0</name>
              <description>Privileged configuration for block 0, belonging to super-block 0

Non-secure write to this bit is ignored if SEC0 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 0, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 0, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV1</name>
              <description>Privileged configuration for block 1, belonging to super-block 0

Non-secure write to this bit is ignored if SEC1 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 1, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 1, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV2</name>
              <description>Privileged configuration for block 2, belonging to super-block 0

Non-secure write to this bit is ignored if SEC2 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 2, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 2, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV3</name>
              <description>Privileged configuration for block 3, belonging to super-block 0

Non-secure write to this bit is ignored if SEC3 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 3, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 3, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV4</name>
              <description>Privileged configuration for block 4, belonging to super-block 0

Non-secure write to this bit is ignored if SEC4 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 4, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 4, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV5</name>
              <description>Privileged configuration for block 5, belonging to super-block 0

Non-secure write to this bit is ignored if SEC5 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 5, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 5, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV6</name>
              <description>Privileged configuration for block 6, belonging to super-block 0

Non-secure write to this bit is ignored if SEC6 bit is set in GTZC1_MPCBB2_SECCFGR0.
Writes are ignored if SPLCK0 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 6, belonging to super-block 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 6, belonging to super-block 0</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV7</name>
              <description>Privileged configuration for block 7, belonging to super-block 0

