ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
Non-secure write to this bit is ignored if SEC11 bit is set in GTZC1_MPCBB2_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 11, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 11, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV12</name>
              <description>Privileged configuration for block 12, belonging to super-block 1

Non-secure write to this bit is ignored if SEC12 bit is set in GTZC1_MPCBB2_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 12, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 12, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV13</name>
              <description>Privileged configuration for block 13, belonging to super-block 1

Non-secure write to this bit is ignored if SEC13 bit is set in GTZC1_MPCBB2_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 13, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 13, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV14</name>
              <description>Privileged configuration for block 14, belonging to super-block 1

Non-secure write to this bit is ignored if SEC14 bit is set in GTZC1_MPCBB2_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 14, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 14, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV15</name>
              <description>Privileged configuration for block 15, belonging to super-block 1

Non-secure write to this bit is ignored if SEC15 bit is set in GTZC1_MPCBB2_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 15, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 15, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV16</name>
              <description>Privileged configuration for block 16, belonging to super-block 1

Non-secure write to this bit is ignored if SEC16 bit is set in GTZC1_MPCBB2_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 16, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 16, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV17</name>
              <description>Privileged configuration for block 17, belonging to super-block 1

Non-secure write to this bit is ignored if SEC17 bit is set in GTZC1_MPCBB2_SECCFGR1.
Writes are ignored if SPLCK1 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 17, belonging to super-block 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 17, belonging to super-block 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV18</name>
              <description>Privileged configuration for block 18, belonging to super-block 1

