ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
        <register>
          <name>PWR_PUCRA</name>
          <displayName>PWR port A pull-up control register</displayName>
          <description>Exit of Standby mode: not affected
Each bit PUy is protected against nonsecure access when SECy = 1 in GPIOA_SECCFGR. Each bit PUy is protected against unprivileged access when SECy = 1 in GPIOA_SECCFGR and SPRIV = 1 in PWR_PRIVCFGR, or when SECy = 0 and NSPRIV = 1.</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PU0</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU1</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU2</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU3</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU4</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU5</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU6</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU7</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU8</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU9</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU10</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU11</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU12</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU13</name>
              <description>Port A pull-up bit y
When set, each bit activates the pull-up on PAy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU15</name>
              <description>Port A pull-up bit 15
When set, each bit activates the pull-up on PA15 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD15 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PDCRA</name>
          <displayName>PWR port A pull-down control register</displayName>
          <description>Exit of Standby mode: not affected
Each bit PDy is protected against nonsecure access when SECy = 1 in GPIOA_SECCFGR. Each bit PDy is protected against unprivileged access when SECy = 1 in GPIOA_SECCFGR and SPRIV = 1 in PWR_PRIVCFGR, or when SECy = 0 and NSPRIV = 1.</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD0</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD1</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD2</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD3</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD4</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD5</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD6</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD7</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD8</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD9</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD10</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD11</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD12</name>
              <description>Port A pull-down bit y
When set, each bit activates the pull-down on PAy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD14</name>
              <description>Port A pull-down bit 14
When set, each bit activates the pull-down on PA14 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PDCRB</name>
          <displayName>PWR port B pull-down control register</displayName>
          <description>Exit of Standby mode: not affected
Each bit PDy is protected against nonsecure access when SECy = 1 in GPIOB_SECCFGR. Each bit PDy is protected against unprivileged access when SECy = 1 in GPIOB_SECCFGR and SPRIV = 1 in PWR_PRIVCFGR, or when SECy = 0 and NSPRIV = 1.</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD0</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD1</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD2</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD3</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD5</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD6</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD7</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD8</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD9</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD10</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD11</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD12</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD13</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD14</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD15</name>
              <description>Port B pull-down bit y
When set, each bit activates the pull-down on PBy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
