ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
        <register>
          <name>PWR_PUCRH</name>
          <displayName>PWR port H pull-up control register</displayName>
          <description>Exit of Standby mode: not affected
Each bit PUy is protected against nonsecure access when SECy = 1 in GPIOH_SECCFGR.
Each bit PUy is protected against unprivileged access when SECy = 1 in GPIOH_SECCFGR and SPRIV = 1 in PWR_PRIVCFGR, or when SECy = 0 and NSPRIV = 1.</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PU0</name>
              <description>Port H pull-up bit y
When set, each bit activates the pull-up on PHy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU1</name>
              <description>Port H pull-up bit y
When set, each bit activates the pull-up on PHy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDy bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU3</name>
              <description>Port H pull-up bit 3
When set, each bit activates the pull-up on PH3 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD3 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PDCRH</name>
          <displayName>PWR port H pull-down control register</displayName>
          <description>Exit of Standby mode: not affected
Each bit PDy is protected against nonsecure access when SECy = 1 in GPIOH_SECCFGR. Each bit PDy is protected against unprivileged access when SECy = 1 in GPIOH_SECCFGR and SPRIV = 1 in PWR_PRIVCFGR, or when SECy = 0 and NSPRIV = 1.</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD0</name>
              <description>Port H pull-down bit y
When set, each bit activates the pull-down on PHy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD1</name>
              <description>Port H pull-down bit y
When set, each bit activates the pull-down on PHy when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD3</name>
              <description>Port H pull-down bit 3
When set, each bit activates the pull-down on PH3 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_I3CPUCR1</name>
          <displayName>PWR I3C pull-up control register 1</displayName>
          <description>Exit of Standby mode: not affected
Each bit Pxy_I3CPU is protected against nonsecure access when SECy = 1 in GPIOx_SECCFGR.
Each bit Pxy_I3CPU is protected against unprivileged access when SECy = 1 in GPIOx_SECCFGR and SPRIV = 1 in PWR_PRIVCFGR, or when SECy = 0 and NSPRIV = 1.</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PA1_I3CPU</name>
              <description>Port A pin 1 I3C pull-up
When set, the bit activates the I3C pull-up on PA1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA6_I3CPU</name>
              <description>Port A pin y I3C pull-up
When set, the bit activates the I3C pull-up on PAy.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA7_I3CPU</name>
              <description>Port A pin y I3C pull-up
When set, the bit activates the I3C pull-up on PAy.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2_I3CPU</name>
              <description>Port B pin 2 I3C pull-up
When set, the bit activates the I3C pull-up on PB2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB6_I3CPU</name>
              <description>Port B pin 6 I3C pull-up
When set, the bit activates the I3C pull-up on PB6.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB8_I3CPU</name>
              <description>Port B pin y I3C pull-up
When set, the bit activates the I3C pull-up on PBy.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB9_I3CPU</name>
              <description>Port B pin y I3C pull-up
When set, the bit activates the I3C pull-up on PBy.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB10_I3CPU</name>
              <description>Port B pin y I3C pull-up
When set, the bit activates the I3C pull-up on PBy.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB12_I3CPU</name>
              <description>Port B pin x I3C pull-up
When set, the bit activates the I3C pull-up on PBx.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB13_I3CPU</name>
              <description>Port B pin x I3C pull-up
When set, the bit activates the I3C pull-up on PBx.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB7_I3CPU</name>
              <description>Port B pin 7 I3C pull-up
When set, the bit activates the I3C pull-up on PB7.
Note: This bit is only available on STM32U3B5/3C5.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_I3CPUCR2</name>
          <displayName>PWR I3C pull-up control register 2</displayName>
          <description>Exit of Standby mode: not affected
Each bit Pxy_I3CPU is protected against nonsecure access when SECy = 1 in GPIOx_SECCFGR.
Each bit Pxy_I3CPU is protected against unprivileged access when SECy = 1 in GPIOx_SECCFGR and SPRIV = 1 in PWR_PRIVCFGR, or when SECy = 0 and NSPRIV = 1.</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PH3_I3CPU</name>
              <description>Port H pin 3 I3C pull-up
When set, the bit activates the I3C pull-up on PH3.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
