ZigaMahne/STM32U3xx_DFP/CMSIS/SVD/STM32U345.svd
        <register>
          <name>RCC_ICSCR1</name>
          <displayName>RCC internal clock source calibration register 1</displayName>
          <description>X is factory-programmed.</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB4000000</resetValue>
          <resetMask>0xFFFFF000</resetMask>
          <fields>
            <field>
              <name>MSICAL1</name>
              <description>MSIRC1 clock calibration for MSI ranges 4 to 7
These bits are initialized at startup with the factory-programmed MSIRC1 calibration trim value for ranges 4 to 7. When MSITRIM1 is written, MSICAL1 is updated with the sum of MSITRIM1[5:0] and the factory-programmed calibration trim value MSIRC1[5:0].
There is no hardware protection to limit a potential overflow due to the addition of MSITRIM bit field and factory program bit field for this calibration value. Control must be managed by software at user level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MSICAL0</name>
              <description>MSIRC0 clock calibration for MSI ranges 0 to 3
These bits are initialized at startup with the factory-programmed MSIRC0 calibration trim value for ranges 0 to 3. When MSITRIM0 is written, MSICAL0 is updated with the sum of MSITRIM0[5:0] and the factory-programmed calibration trim value MSIRC0[5:0].
There is no hardware protection to limit a potential overflow due to the addition of MSITRIM bit field and factory program bit field for this calibration value. Control must be managed by software at user level.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MSIHSINDIV</name>
              <description>MSIRCx (x = 0, 1) PLL mode HSE input division
This bit is used to divide the HSE input clock when used by MSIRCx (x = 0, 1) in PLL mode. MSIRCx high-speed input clock must be 16 MHz.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>HSE (16 MHz) is used as MSI input clock when PLL mode with high-speed clock is selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>HSE (32 MHz)/2 is used as MSI input clock when PLL mode with high-speed clock is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSIPLL1SEL</name>
              <description>MSIRC1 PLL mode input clock selection
LSE or HSE must be enabled and ready before selecting this oscillator as MSIRC1 input clock.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>LSE is used as MSIRC1 input clock when PLL mode is selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>HSE or HSE/2 is used as MSIRC1 input clock when PLL mode is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSIPLL0SEL</name>
              <description>MSIRC0 PLL mode input clock selection
LSE or HSE must be enabled and ready before selecting this oscillator as MSIRC0 input clock.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>LSE is used as MSIRC0 input clock when PLL mode is selected.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>HSE or HSE/2 is used as MSIRC0 input clock when PLL mode is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSIBIAS</name>
              <description>MSI bias mode selection
By default, the MSI bias (for both MSIS and MSIK) is in continuous mode in order to maintain the output clocks accuracy. Setting this bit reduces the MSI consumption when the device is in Stop 1 or Stop 2 mode, or when the regulator is in range 2, but it decreases the MSI accuracy</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>MSI bias continuous mode (clock accuracy fast settling time)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>MSI bias sampling mode when the device is in Stop 1 or Stop 2 mode, or when the regulator is in range 2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSIRGSEL</name>
              <description>MSI clock range selection
Set by software to select the MSIS/MSIK frequency range, using MSISSEL/MSIKSEL and MSISDIV[1:0]/MSIKDIV[1:0] bit fields. Writing 0 has no effect.
After exiting Standby or Shutdown mode, or after a reset, this bit is at 0, and the MSIS and MSIK ranges are provided by MSISDIVS[1:0] and MSIKDIVS[1:0] in RCC_CSR.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>MSIS/MSIK ranges provided by MSISDIVS[1:0] and MSIKDIVS[1:0] in RCC_CSR</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>MSIS/MSIK ranges provided by MSISDIV[1:0] and MSIKDIV[1:0] in RCC_ICSCR1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSIPLL1N</name>
              <description>MSIRC1 PLL mode with LSE multiplication factor
These bits select the frequency of MSIRC1 in PLL mode, impacting range 4, 5, 6 and 7 frequencies. These bits have no effect when the PLL mode is disabled. 
Note: Refer to Table 97: MSIS and MSIK ranges per internal MSIRCs (PLL mode disabled) for MSIS/MSIK clock output depends on input and configuration.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSIKDIV</name>
              <description>MSIK oscillator division
These bits are configured by software to choose the frequency of MSIK oscillator when MSIRGSEL is set.
Note: MSIKDIV can be modified when MSIK is OFF (MSIKON = 0) or when MSIK is ready (MSIKRDY = 1). MSIKDIV must NOT be modified when MSIK is ON and NOT ready (MSIKON = 1 and MSIKRDY = 0). MSIKDIV is kept when the device wakes up from Stop mode, except when the MSIK range is above 48 MHz. In this case MSIKDIV is changed by hardware into range 1 (48 MHz). The frequencies slightly differ in PLL mode (refer to datasheet for more information).</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0_MSIKSEL_BIT_IN_RCC_ICSCR1__EQUAL_0</name>
                  <description>MSIRC0/1 is selected for MSIK (range 0 around 96 MHz).</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1_MSIKSEL_BIT_IN_RCC_ICSCR1__EQUAL_0</name>
                  <description>MSIRC0/2 is selected for MSIK (range 1 around 48 MHz).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2_MSIKSEL_BIT_IN_RCC_ICSCR1__EQUAL_0</name>
                  <description>MSIRC0/4 is selected for MSIK (range 2 around 24 MHz).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3_MSIKSEL_BIT_IN_RCC_ICSCR1__EQUAL_0</name>
                  <description>MSIRC0/8 is selected for MSIK (range 3 around 12 MHz).</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSIKSEL</name>
              <description>MSIK clock source selection
These bits are configured by software to select the RC oscillator used to generate MSIK clock when MSIRGSEL is set.
Note: MSIKSEL can be modified when MSIK is OFF (MSIKON = 0) or when MSIK is ready (MSIKRDY = 1). MSIKSEL must not be modified when MSIK is ON and NOT ready (MSIKON = 1 and MSIKRDY = 0). MSIKSEL is kept when the device wakes up from Stop mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>MSIRC0 (96 MHz) is selected as source to generate MSIK.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>MSIRC1 (24 MHz) is selected as source to generate MSIK.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSISDIV</name>
              <description>MSIS oscillator division
These bits are configured by software to choose the frequency of MSIS oscillator when MSIRGSEL is set. 
Note: MSISDIV can be modified when MSIS is OFF (MSISON = 0) or when MSIS is ready (MSISRDY = 1). MSISDIV must NOT be modified when MSIS is ON and NOT ready (MSISON = 1 and MSISRDY = 0). MSISDIV is kept when the device wakes up from Stop mode, except when the MSIS range is above 48 MHz. In this case, MSISDIV is changed by hardware into range 1 (48 MHz).The frequencies slightly differ in PLL mode (refer to datasheet for more information).</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0_MSISSEL_BIT_IN_RCC_ICSCR1__EQUAL_0</name>
                  <description>MSIRC0/1 is selected for MSIS (range 0 around 96 MHz).</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1_MSISSEL_BIT_IN_RCC_ICSCR1__EQUAL_0</name>
                  <description>MSIRC0/2 is selected for MSIS (range 1 around 48 MHz).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2_MSISSEL_BIT_IN_RCC_ICSCR1__EQUAL_0</name>
                  <description>MSIRC0/4 is selected for MSIS (range 2 around 24 MHz).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3_MSISSEL_BIT_IN_RCC_ICSCR1__EQUAL_0</name>
                  <description>MSIRC0/8 is selected for MSIS (range 3 around 12 MHz).</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSISSEL</name>
              <description>MSIS clock source selection
These bits are configured by software to select the RC oscillator used to generate MSIS clock when MSIRGSEL is set. 
Note: MSISSEL can be modified when MSIS is OFF (MSISON = 0) or when MSIS is ready (MSISRDY = 1). MSISSEL must not be modified when MSIS is ON and NOT ready (MSISON = 1 and MSISRDY = 0). MSISSEL is kept when the device wakes up from Stop mode.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>MSIRC0 (96 MHz) is selected as source to generate MSIS.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>MSIRC1 (24 MHz) is selected as source to generate MSIS.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC_ICSCR2</name>
          <displayName>RCC internal clock source calibration register 2</displayName>
          <description>None</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000820</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSITRIM1</name>
              <description>MSIRC1 clock trimming for ranges 4 to 7
These bits provide an additional user-programmable trimming value that is added to the factory-programmed calibration trim value MSIRC1[5:0] bits. It can be programmed to adjust to voltage and temperature variations that influence the frequency of the MSI.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSITRIM0</name>
              <description>MSIRC0 clock trimming for ranges 0 to 3
These bits provide an additional user-programmable trimming value that is added to the factory-programmed calibration trim value MSIRC0[5:0] bits. It can be programmed to adjust to voltage and temperature variations that influence the frequency of the MSI.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC_ICSCR3</name>
          <displayName>RCC internal clock source calibration register 3</displayName>
          <description>X is factory-programmed.</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00100000</resetValue>
          <resetMask>0xFFFFF000</resetMask>
          <fields>
            <field>
              <name>HSICAL</name>
              <description>HSI clock calibration
These bits are initialized at startup with the factory-programmed HSI calibration trim value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSITRIM</name>
              <description>HSI clock trimming
These bits provide an additional user-programmable trimming value. It can be programmed to adjust to voltage and temperature variations that influence the frequency of the HSI.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCC_CRRCR</name>
          <displayName>RCC clock recovery RC register</displayName>
          <description>X is factory-programmed.</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFF000</resetMask>
          <fields>
            <field>
              <name>HSI48CAL</name>
              <description>HSI48 clock calibration
These bits are initialized at startup with the factory-programmed HSI48 calibration trim value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
